---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.RebarShapeConstraintSagittaLength
source: html/3ee41e29-4070-435d-ab84-a615668a66ae.htm
---
# RebarShapeConstraintSagittaLength Properties

Specifies whether the .NET object represents a valid Revit entity.